In [2]:
import numpy as np
import pandas as pd

## Series

In [5]:
benimSozlugum = {"Atil":50,"Zeynep":50,"Mehmet":30}

In [7]:
pd.Series(benimSozlugum)

Atil      50
Zeynep    50
Mehmet    30
dtype: int64

In [9]:
type(pd.Series(benimSozlugum))

pandas.core.series.Series

In [15]:
benimYaslarim = [50,40,30]
benimIsimlerim = ["Atil","Zeynep","Mehmet"]
pd.Series(benimYaslarim)

0    50
1    40
2    30
dtype: int64

In [17]:
pd.Series(benimYaslarim,benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [19]:
pd.Series(data=benimYaslarim,index=benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [23]:
numpyDizisi = np.array([50,40,30])
numpyDizisi

array([50, 40, 30])

In [25]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
dtype: int32

In [29]:
pd.Series(numpyDizisi,benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int32

In [31]:
pd.Series(["Atil","Atlas","Osman"],[1,2,3])

1     Atil
2    Atlas
3    Osman
dtype: object

In [35]:
yarismaSonucu1 = pd.Series([10,5,1],["Atil","Atlas","Osman"])
yarismaSonucu1

Atil     10
Atlas     5
Osman     1
dtype: int64

In [37]:
yarismaSonucu2 = pd.Series([20,10,8],["Atil","Atlas","Osman"])
yarismaSonucu2

Atil     20
Atlas    10
Osman     8
dtype: int64

In [39]:
yarismaSonucu2["Atlas"]

10

In [41]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2
sonSonuc

Atil     30
Atlas    15
Osman     9
dtype: int64

In [43]:
farkliSeries = pd.Series([20,30,40,50],["a","b","c","d"])
farkliSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])
farkliSeries

a    20
b    30
c    40
d    50
dtype: int64

In [47]:
farkliSeries2

a    10
c     5
f     3
g     1
dtype: int64

In [49]:
farkliSeries + farkliSeries2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

## Data Frame

In [54]:
data = np.random.randn(4,3)
data

array([[ 0.76823446, -0.46455591,  0.21972627],
       [ 1.38143795,  2.2257461 ,  0.16343064],
       [ 0.76163348, -0.26134322,  0.02765659],
       [ 0.79336447,  1.36910516, -0.20471941]])

In [56]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  0.768234 -0.464556  0.219726
1  1.381438  2.225746  0.163431
2  0.761633 -0.261343  0.027657
3  0.793364  1.369105 -0.204719

In [58]:
dataFrame[0]

0    0.768234
1    1.381438
2    0.761633
3    0.793364
Name: 0, dtype: float64

In [60]:
type(dataFrame[0])

pandas.core.series.Series

In [62]:
dataFrame[0][1]

1.3814379502133238

In [66]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns = ["Maas","Yas","Calisma Saati"])
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.768234 -0.464556       0.219726
Zeynep  1.381438  2.225746       0.163431
Atlas   0.761633 -0.261343       0.027657
Mehmet  0.793364  1.369105      -0.204719

In [68]:
yeniDataFrame["Yas"]

Atil     -0.464556
Zeynep    2.225746
Atlas    -0.261343
Mehmet    1.369105
Name: Yas, dtype: float64

In [70]:
yeniDataFrame["Calisma Saati"]

Atil      0.219726
Zeynep    0.163431
Atlas     0.027657
Mehmet   -0.204719
Name: Calisma Saati, dtype: float64

In [72]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.768234 -0.464556
Zeynep  1.381438  2.225746
Atlas   0.761633 -0.261343
Mehmet  0.793364  1.369105

In [74]:
yeniDataFrame.loc["Atil"]

Maas             0.768234
Yas             -0.464556
Calisma Saati    0.219726
Name: Atil, dtype: float64

In [76]:
yeniDataFrame.loc["Zeynep"]

Maas             1.381438
Yas              2.225746
Calisma Saati    0.163431
Name: Zeynep, dtype: float64

In [78]:
yeniDataFrame.iloc[1]

Maas             1.381438
Yas              2.225746
Calisma Saati    0.163431
Name: Zeynep, dtype: float64

In [80]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.768234 -0.464556       0.219726
Zeynep  1.381438  2.225746       0.163431
Atlas   0.761633 -0.261343       0.027657
Mehmet  0.793364  1.369105      -0.204719

In [84]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.768234 -0.464556       0.219726       -0.929112
Zeynep  1.381438  2.225746       0.163431        4.451492
Atlas   0.761633 -0.261343       0.027657       -0.522686
Mehmet  0.793364  1.369105      -0.204719        2.738210

In [88]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

            Maas       Yas  Calisma Saati
Atil    0.768234 -0.464556       0.219726
Zeynep  1.381438  2.225746       0.163431
Atlas   0.761633 -0.261343       0.027657
Mehmet  0.793364  1.369105      -0.204719

In [92]:
yeniDataFrame.drop("Mehmet",axis=0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.768234 -0.464556       0.219726       -0.929112
Zeynep  1.381438  2.225746       0.163431        4.451492
Atlas   0.761633 -0.261343       0.027657       -0.522686

In [94]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.768234 -0.464556       0.219726       -0.929112
Zeynep  1.381438  2.225746       0.163431        4.451492
Atlas   0.761633 -0.261343       0.027657       -0.522686
Mehmet  0.793364  1.369105      -0.204719        2.738210

In [96]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.768234 -0.464556       0.219726
Zeynep  1.381438  2.225746       0.163431
Atlas   0.761633 -0.261343       0.027657
Mehmet  0.793364  1.369105      -0.204719

In [98]:
yeniDataFrame.loc["Atil"]["Yas"]

-0.4645559134715611

In [100]:
yeniDataFrame.loc["Atil"]["Calisma Saati"]

0.21972627422165122

In [102]:
yeniDataFrame.loc["Atlas","Yas"]

-0.26134322136965715

In [104]:
yeniDataFrame < 0

         Maas    Yas  Calisma Saati
Atil    False   True          False
Zeynep  False  False          False
Atlas   False   True          False
Mehmet  False  False           True

In [106]:
booleanFrame = yeniDataFrame < 0
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.768234 -0.464556       0.219726
Zeynep  1.381438  2.225746       0.163431
Atlas   0.761633 -0.261343       0.027657
Mehmet  0.793364  1.369105      -0.204719

In [108]:
yeniDataFrame[booleanFrame]

        Maas       Yas  Calisma Saati
Atil     NaN -0.464556            NaN
Zeynep   NaN       NaN            NaN
Atlas    NaN -0.261343            NaN
Mehmet   NaN       NaN      -0.204719

In [110]:
yeniDataFrame[yeniDataFrame < 0]

        Maas       Yas  Calisma Saati
Atil     NaN -0.464556            NaN
Zeynep   NaN       NaN            NaN
Atlas    NaN -0.261343            NaN
Mehmet   NaN       NaN      -0.204719

In [112]:
yeniDataFrame["Yas"]

Atil     -0.464556
Zeynep    2.225746
Atlas    -0.261343
Mehmet    1.369105
Name: Yas, dtype: float64

In [114]:
yeniDataFrame["Yas"] > 0

Atil      False
Zeynep     True
Atlas     False
Mehmet     True
Name: Yas, dtype: bool

In [116]:
yeniDataFrame[yeniDataFrame["Yas"] > 0 ]

            Maas       Yas  Calisma Saati
Zeynep  1.381438  2.225746       0.163431
Mehmet  0.793364  1.369105      -0.204719

In [118]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.768234 -0.464556       0.219726
Zeynep  1.381438  2.225746       0.163431
Atlas   0.761633 -0.261343       0.027657
Mehmet  0.793364  1.369105      -0.204719

In [120]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  0.768234 -0.464556       0.219726
1  Zeynep  1.381438  2.225746       0.163431
2   Atlas  0.761633 -0.261343       0.027657
3  Mehmet  0.793364  1.369105      -0.204719

In [122]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.768234 -0.464556       0.219726
Zeynep  1.381438  2.225746       0.163431
Atlas   0.761633 -0.261343       0.027657
Mehmet  0.793364  1.369105      -0.204719

In [146]:
yeniIndexList = ["Ati","Zey","Atl","Meh"]

In [148]:
yeniDataFrame["Yeni Indeks"] = yeniIndexList

In [150]:
yeniDataFrame

                 Maas       Yas  Calisma Saati Yeni Indeks
Yeni Indeks
Ati          0.768234 -0.464556       0.219726         Ati
Zey          1.381438  2.225746       0.163431         Zey
Atl          0.761633 -0.261343       0.027657         Atl
Meh          0.793364  1.369105      -0.204719         Meh

In [152]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          0.768234 -0.464556       0.219726
Zey          1.381438  2.225746       0.163431
Atl          0.761633 -0.261343       0.027657
Meh          0.793364  1.369105      -0.204719

In [132]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    0.768234 -0.464556       0.219726         Ati
Zeynep  1.381438  2.225746       0.163431         Zey
Atlas   0.761633 -0.261343       0.027657         Atl
Mehmet  0.793364  1.369105      -0.204719         Meh

In [154]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [156]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          0.768234 -0.464556       0.219726
Zey          1.381438  2.225746       0.163431
Atl          0.761633 -0.261343       0.027657
Meh          0.793364  1.369105      -0.204719

In [158]:
yeniDataFrame.loc["Ati"]

Maas             0.768234
Yas             -0.464556
Calisma Saati    0.219726
Name: Ati, dtype: float64

In [161]:
ilkIndexler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]
icIndexler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]
birlesmisIndex = list(zip(ilkIndexler,icIndexler))
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [165]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [167]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [171]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["Yas","Meslek"])
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [173]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [175]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [177]:
cizgiFilmDataFrame.index.names = ["Film Ad","sim"]

In [179]:
cizgiFilmDataFrame

                   Yas Meslek
Film Ad   sim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

## Operasyonlar

In [207]:
sozlukVerisi = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25],"Izmir": [40, 39, 38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [209]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [211]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [213]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [215]:
yeniVeri = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 25],"Izmir": [40, 39, 38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [217]:
yeniDataFrame.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [219]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Group By

In [234]:
maasSozlugu = {"Departman":["Yazlm","Yazlm","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Calisan Ismi":["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500]
              }
maasDataFrame = pd.DataFrame(maasSozlugu)
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazlm        Ahmet   100
1    Yazlm       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [242]:
grupObjesi = maasDataFrame.groupby("Departman")
grupObjesi.count()
#grupObjesi.mean()
#grupObjesi.min()
#grupObjesi.max()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazlm               2     2

In [244]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazlm     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## Concat ve Merge

In [247]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atil"],
           "Spor" : ["Kou","Yzme","Kou","Basketbol"],
           "Kalori" : [100,200,300,400]
          }

In [249]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Kou     100
1  Mehmet      Yzme     200
2  Zeynep       Kou     300
3    Atil  Basketbol     400

In [251]:
sozluk2 = {"Isim" : ["Ahmet","Levent","Atlas","Fatma"],
           "Spor" : ["Kou","Yzme","Kou","Basketbol"],
           "Kalori" : [200,100,50,300]
          }

In [253]:
dataFrame2= pd.DataFrame(sozluk2,index=[4,5,6,7])
dataFrame2

     Isim       Spor  Kalori
4   Ahmet       Kou     200
5  Levent      Yzme     100
6   Atlas       Kou      50
7   Fatma  Basketbol     300

In [257]:
sozluk3 = {"Isim" : ["Ayse","Mahmut","Duygu","Nur"],
           "Spor" : ["Kou","Yzme","Badminton","Tenis"],
           "Kalori" : [300,400,500,300]
          }
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])
dataFrame3

      Isim       Spor  Kalori
8     Ayse       Kou     300
9   Mahmut      Yzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     300

In [263]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0    Ahmet       Kou     100
1   Mehmet      Yzme     200
2   Zeynep       Kou     300
3     Atil  Basketbol     400
4    Ahmet       Kou     200
5   Levent      Yzme     100
6    Atlas       Kou      50
7    Fatma  Basketbol     300
8     Ayse       Kou     300
9   Mahmut      Yzme     400
10   Duygu  Badminton     500
11     Nur      Tenis     300

In [265]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atil"],
           "Spor" : ["Kou","Yzme","Kou","Basketbol"],
          }
mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atil"],
           "Kalori" : [100,200,250,150]
          }

In [269]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)
mergeDataFrame1

     Isim       Spor
0   Ahmet       Kou
1  Mehmet      Yzme
2  Zeynep       Kou
3    Atil  Basketbol

In [271]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3    Atil     150

In [273]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Kou     100
1  Mehmet      Yzme     200
2  Zeynep       Kou     250
3    Atil  Basketbol     150

In [275]:
maasSozluk = {"Isim" : ["Atil","Zeynep","Mehmet","Ahmet"],
           "Departman" : ["Yazlm","Sat","Pazarlama","Yazlm"],
              "Maas" : [200,300,400,500]
          }
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazlm   200
1  Zeynep      Sat   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazlm   500

In [277]:
maasDataFrame["Departman"].unique()

array(['Yazlm', 'Sat', 'Pazarlama'], dtype=object)

In [279]:
maasDataFrame["Departman"].nunique()

3

In [281]:
maasDataFrame["Departman"].value_counts()

Departman
Yazlm      2
Sat        1
Pazarlama    1
Name: count, dtype: int64

In [291]:
def bruttenNete(maas):
    return maas * 0.66

In [293]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [295]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [301]:
yeniBirVeri = {"Karakter Snf" : ["South Park","South Park","Simpson","Simpson","Simpson"],
               "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }
karakterDF = pd.DataFrame(yeniBirVeri)
karakterDF

  Karakter Snf Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [309]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Snf","Karakter Ismi"],aggfunc = np.sum) #DataFrameGroupBy.sum.

C:\Users\birca\AppData\Local\Temp\ipykernel_23076\172366684.py:1: FutureWarning: The provided callable <function sum at 0x00000240D9698D60> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Snf","Karakter Ismi"],aggfunc = np.sum) #DataFrameGroupBy.sum.

                               Karakter Yas
Karakter Snf Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [313]:
dataFrame = pd.read_excel("maas.xlsx")
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atl   100  40.0    Yazlm
1     Zeynep   150  50.0      Sat
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [319]:
doluDegerlerDF = dataFrame.dropna()
doluDegerlerDF

  Unnamed: 0  Maas   Yas  Departman
0       Atl   100  40.0    Yazlm
1     Zeynep   150  50.0      Sat
3      Ahmet    50  10.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [321]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0       Atl   100  40.0    Yazlm
1     Zeynep   150  50.0      Sat
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [325]:
doluDegerlerDF.to_excel("yenimaas.xlsx")

In [327]:
## read_csv
## to_csv